-- 使用数据库2211270144
use zhengxf_edu_sys;

-- 添加系部数据
insert into
    zhengxf_dep (d_name)
values
    ('软件学院'),
    ('微电子学院'),
    ('计算机学院'),
    ('数字媒体学院'),
    ('智能制造与装备学院'),
    ('交通与环境学院'),
    ('管理学院'),
    ('财经学院'),
    ('应用外语学院'),
    ('中德机器人学院'),
    ('信息与通信学院'),
    ('体育运动学院（筹）'),
    ('继续教育学院');

-- 添加专业数据
insert into
    zhengxf_major (m_name, m_length, m_dep)
values
    ('软件技术', 3, 1),
    ('大数据技术', 3, 1),
    ('移动互联应用技术', 3, 1),
    ('人工智能技术应用', 3, 1),
    ('区块链技术应用', 3, 1),
    ('微电子技术', 3, 2),
    ('集成电路技术', 3, 2),
    ('智能产品开发与应用', 3, 2),
    ('智能光电技术应用', 3, 2),
    ('计算机应用技术', 3, 3),
    ('计算机网络技术', 3, 3),
    ('信息安全技术应用', 3, 3),
    ('云计算技术应用', 3, 3),
    ('广播影视节目制作', 3, 4),
    ('数字媒体艺术设计', 3, 4),
    ('数字媒体技术', 3, 4),
    ('环境艺术设计', 3, 4),
    ('虚拟现实技术应用', 3, 4),
    ('机械设计与制造', 3, 5),
    ('智能控制技术', 3, 5),
    ('智能光电制造技术', 3, 5),
    ('工业设计', 3, 5),
    ('工业软件开发技术', 3, 5),
    ('智能建造技术', 3, 6),
    ('城市轨道交通运营管理', 3, 6),
    ('环境工程技术', 3, 6),
    ('园林工程技术', 3, 6),
    ('环境监测技术', 3, 6),
    ('电子商务', 3, 7),
    ('现代物流管理', 3, 7),
    ('关务与外贸服务', 3, 7),
    ('文化产业经营与管理', 3, 7),
    ('工商企业管理', 3, 7),
    ('国际商务', 3, 7),
    ('大数据与会计', 3, 8),
    ('财富管理', 3, 8),
    ('金融服务与管理', 3, 8),
    ('会计信息管理', 3, 8),
    ('商务英语', 3, 9),
    ('商务英语', 3, 9),
    ('现代文秘', 3, 9),
    ('学前教育', 3, 9),
    ('工业机器人技术', 3, 10),
    ('工业互联网技术', 3, 10),
    ('嵌入式技术应用', 3, 10),
    ('无人机应用技术', 3, 10),
    ('现代移动通信技术', 3, 11),
    ('智能互联网络技术', 3, 11),
    ('物联网应用技术', 3, 11),
    ('汽车智能技术', 3, 11),
    ('体育艺术表演', 3, 12);

-- 添加班级数据
insert into
    zhengxf_class (cl_name, cl_year, cl_major)
values
    ('22计算机应用技术3-1班', '2022', 10),
    ('22计算机应用技术3-2班', '2022', 10),
    ('22计算机应用技术3-3班', '2022', 10),
    ('22软件技术3-1班', '2022', 1),
    ('22软件技术3-2班', '2022', 1),
    ('22软件技术3-3班', '2022', 1),
    ('21计算机应用技术3-1班', '2021', 10),
    ('21计算机应用技术3-2班', '2021', 10),
    ('21计算机应用技术3-3班', '2021', 10);